{
    "en": [
        {
            "title": "Land of Beginnings",
            "steps": [
                "Upon gaining control of your character, attack the brush until you reveal a door with many locks",
                "Turn in the quest above your head to be transported to the next area"
            ]
        },
        {
            "title": "Land of Warriors",
            "steps": [
                "Complete the minigame by fighting three rounds of warriors",
                "Lower the sun",
                "Accept the quest from Beodog",
                "Speak to three other warriors, accepting or turning in their quests",
                "Go two maps to the right and defeat the Balrog, collecting the key that it drops",
                "Accept the quest over your head. NOTE: Do NOT click through the text, as you will be unnecessarily transported back to the Land of Beginnings. Choose the second option instead, then move back to the main area",
                "Accept the quest from Arsan Lupen",
                "Raise the sun",
                "Choose the first option, 'Last Warrior Standing'",
                "Complete the minigame by fighting three rounds of warriors",
                "Turn in the quest above your head and you will be transported to the next area"
            ]
        },
        {
            "title": "Land of Riches",
            "steps": [
                "Accept and turn in two quests from Joel [60 Food Baskets]",
                "Accept and turn in quest from Mansa and you will be transported to the next area"
            ]
        },
        {
            "title": "Land of Contemplation",
            "steps": [
                "Go three maps to the right and turn in the quest over your head, then accept another quest over your head",
                "Kill 50 ravens",
                "Turn in the quest over your head and you will be transported back to the main area",
                "Accept and turn in the quest from Adler to obtain your first key.",
                "Accept another quest from Adler",
                "Speak with Ashkaya to move to the next area"
            ]
        },
        {
            "title": "Land of Innocence",
            "steps": [
                "Accept and turn in quest from Tina [30 Frozen Treat]",
                "Accept (but do NOT turn in) another quest from Tina [30 Child's Toy]",
                "Before turning in this quest, go to first map with mobs in this area and accept and turn in the quest from the Broken Tree, which will give you your second key",
                "Turn in Tina's quest to Riley, then accept another quest from Riley",
                "Accept Billy's quest",
                "Go to the first map of this area and obtain colored marbles from mobs until you reach 100%, as well as gathering at least one Magic Eyepatch",
                "Turn in Billy's quest",
                "Continuously speak to the Silent Boy until you receive a key",
                "Speak with Lonnie while you have a Magic Eyepatch, proceed to the cutscene, then complete Lonnie's quest to receive a key",
                "Move to the next area"
            ]
        },
        {
            "title": "Land of Warriors",
            "steps": [
                "Lower the sun",
                "Accept the quest over your head",
                "Accept a quest from Vulcanelli",
                "Kill 50 Battle Balrogs and Marauder Mushrooms",
                "Turn in the quest above your head and return to main area",
                "Raise the sun and complete the cutscene",
                "Lower the sun",
                "Turn in the quest over your head",
                "Move to the next area"
            ]
        },
        {
            "title": "Land of Riches",
            "steps": [
                "Move to the next area"
            ]
        },
        {
            "title": "Land of Contemplation",
            "steps": [
                "Accept a quest from Nameless Soul",
                "Move three maps to the right and kill the raven, then pick up the key it drops",
                "Accept quest over your head to obtain a key, then return to the main area",
                "Turn in the quest to Nameless Soul",
                "Accept a quest from Adler",
                "Speak to Unfulfilled Soul, Nameless Soul and Oblivious Soul respectively to donate your colors",
                "Turn in the quest to Adler",
                "Stand beside the man sitting on a bench and press the NPC key, accept the quest and you'll be transported to a new location",
                "Kill the Yellow Mage, complete the cutscene and then you'll receive a key and be transported back to the main area",
                "Move to next area"
            ]
        },
        {
            "title": "Land of Innocence",
            "steps": [
                "Accept a quest from Tina",
                "Obtain a book from any mob in the area",
                "Turn in quest to Tina",
                "Accept quest from Tina",
                "Purchase a Brand New Teddy Bear for 10,000 mesos",
                "Turn in quest to Tina",
                "Accept another quest from Tina",
                "Double click the book in your inventory to receive a key",
                "Move to the next area"
            ]
        },
        {
            "title": "Land of Warriors",
            "steps": [
                "Raise the sun",
                "Choose 'Last Warrior Standing'",
                "Complete minigame by fighting three rounds of warriors",
                "Turn in the quest above your head",
                "Turn in quest to Beodog",
                "Move to the next area"
            ]
        },
        {
            "title": "Land of Riches",
            "steps": [
                "Enter the portal on the far left and accept a quest from Old Tombstone Maker",
                "Attack the rock on the far right until a stone drops, then take the stone to the Old Tombstone Maker. Notice the time you complete this step, as you can only turn in this quest after 10 minutes",
                "Return to the main area, then accept both quests from Joel. One quest, 'A Tasteful Flavor,' is a repeatable quest that gives you an important item called Delicious Gold Piece. The other quest asks you to gather [10 Food Baskets]. Once you gather these, turn the quest in and accept another quest that tasks you with eliminating 100 Treasure Thief Moustrocity. Complete both of these quests, then accept another quest from Joel",
                "Move Joel's chest outside, then turn in the quest to Joel",
                "Continue completing Joel's repeatable quest 'A Tasteful Flavor' until you have a total of 6 Delicious Gold Pieces. This quest asks you to either gather [20 Food Baskets] or eliminate 50 Treasure Thief Moustrocity, so it is wise to gather extra Food Baskets in the second map of this area while killing Treasure Thief Moustrocity in this map as well",
                "Accept a quest from Ben and choose the last option",
                "Accept a quest from Mansa",
                "Click on the bag of coins in the top right corner to accept a quest",
                "Talk to Horemheb",
                "Accept quest over your head",
                "Turn in the quest to Louie the Average",
                "Move to the next area"
            ]
        },
        {
            "title": "Land of Contemplation",
            "steps": [
                "Move to the next area"
            ]
        },
        {
            "title": "Land of Innocence",
            "steps": [
                "Click on the bowl of sweets in front of Tina to make it rain (do NOT accept or turn in any quests in this area)",
                "Move to the next area"
            ]
        },
        {
            "title": "Land of Warriors",
            "steps": [
                "Click on the statue on the far right to accept a new quest",
                "Turn in the quest to Edgar Tetch",
                "Click on the statue again to accept another quest",
                "Consume three Delicious Gold Pieces, then speak to Vulcanelli to obtain a key",
                "Move to the next area"
            ]
        },
        {
            "title": "Land of Riches",
            "steps": [
                "Speak to Horemheb to obtain a key",
                "10 minutes should have passed by now, so enter the portal to the far left and accept the quest from Old Tombstone Maker and receive a new key NOTE: Do NOT click through the text here. You will be presented with three options to change the color of your tombstone when you die. This is a permanent change, so be careful which option you choose. If you click through the text, you will choose the gold tombstone",
                "Leave the map and re-enter; the Old Tombstone Maker will have moved to the far right, so accept his new quest",
                "Move right and attack all five tombstones to make them fall to the area below, then move left and speak to Old Tombstone Maker",
                "Turn in the quest to Old Tombstone Maker to receive a key",
                "Exit to the main area, consume the last three gold pieces while outside of the walls, then attack the wall until a cutscene occurs",
                "Turn in the quest to Mansa",
                "Turn in and accept a new quest from Ben",
                "Move Ben and his chest outside",
                "Move to the next area four times, cycling through all of the lands until you arrive back in the Land of Riches",
                "Accept a quest from Mansa",
                "Turn in the quest to Mansa's Pile o' Treasure Puke to obtain your last key!",
                "Move to the Land of Beginnings, click on each lock and complete the content"
            ]
        }
    ],
    "es": [
        {
            "title": "Tierra de los Comienzos",
            "steps": [
                "Al obtener el control de tu personaje, ataca el arbusto hasta que reveles una puerta con muchos candados",
                "Entrega la misión sobre tu cabeza para ser transportado a la siguiente área"
            ]
        },
        {
            "title": "Tierra de los Guerreros",
            "steps": [
                "Completa el minijuego luchando contra tres rondas de guerreros",
                "Baja el sol",
                "Acepta la misión de Beodog",
                "Habla con otros tres guerreros, aceptando o entregando sus misiones",
                "Ve dos mapas a la derecha y derrota al Balrog, recolectando la llave que deja caer",
                "Acepta la misión sobre tu cabeza. NOTA: NO hagas clic en el texto, ya que serás transportado innecesariamente de vuelta a la Tierra de los Comienzos. Elige la segunda opción en su lugar, luego regresa al área principal",
                "Acepta la misión de Arsan Lupen",
                "Sube el sol",
                "Elige la primera opción, 'Último Guerrero en Pie'",
                "Completa el minijuego luchando contra tres rondas de guerreros",
                "Entrega la misión sobre tu cabeza y serás transportado a la siguiente área"
            ]
        },
        {
            "title": "Tierra de las Riquezas",
            "steps": [
                "Acepta y entrega dos misiones de Joel [60 Cestas de Comida]",
                "Acepta y entrega la misión de Mansa y serás transportado a la siguiente área"
            ]
        },
        {
            "title": "Tierra de la Contemplación",
            "steps": [
                "Ve tres mapas a la derecha y entrega la misión sobre tu cabeza, luego acepta otra misión sobre tu cabeza",
                "Mata 50 cuervos",
                "Entrega la misión sobre tu cabeza y serás transportado de vuelta al área principal",
                "Acepta y entrega la misión de Adler para obtener tu primera llave.",
                "Acepta otra misión de Adler",
                "Habla con Ashkaya para moverte a la siguiente área"
            ]
        },
        {
            "title": "Tierra de la Inocencia",
            "steps": [
                "Acepta y entrega la misión de Tina [30 Golosinas Congeladas]",
                "Acepta (pero NO entregues) otra misión de Tina [30 Juguetes de Niño]",
                "Antes de entregar esta misión, ve al primer mapa con monstruos en esta área y acepta y entrega la misión del Árbol Roto, que te dará tu segunda llave",
                "Entrega la misión de Tina a Riley, luego acepta otra misión de Riley",
                "Acepta la misión de Billy",
                "Ve al primer mapa de esta área y obtén canicas de colores de los monstruos hasta llegar al 100%, además de reunir al menos un Parche Mágico para el Ojo",
                "Entrega la misión de Billy",
                "Habla continuamente con el Niño Silencioso hasta que recibas una llave",
                "Habla con Lonnie mientras tienes un Parche Mágico para el Ojo, procede a la escena, luego completa la misión de Lonnie para recibir una llave",
                "Muévete a la siguiente área"
            ]
        },
        {
            "title": "Tierra de los Guerreros",
            "steps": [
                "Baja el sol",
                "Acepta la misión sobre tu cabeza",
                "Acepta una misión de Vulcanelli",
                "Mata 50 Balrogs de Batalla y Hongos Merodeadores",
                "Entrega la misión sobre tu cabeza y regresa al área principal",
                "Sube el sol y completa la escena",
                "Baja el sol",
                "Entrega la misión sobre tu cabeza",
                "Muévete a la siguiente área"
            ]
        },
        {
            "title": "Tierra de las Riquezas",
            "steps": [
                "Muévete a la siguiente área"
            ]
        },
        {
            "title": "Tierra de la Contemplación",
            "steps": [
                "Acepta una misión de Alma sin Nombre",
                "Ve tres mapas a la derecha y mata al cuervo, luego recoge la llave que deja caer",
                "Acepta la misión sobre tu cabeza para obtener una llave, luego regresa al área principal",
                "Entrega la misión a Alma sin Nombre",
                "Acepta una misión de Adler",
                "Habla con Alma Insatisfecha, Alma sin Nombre y Alma Obliviosa respectivamente para donar tus colores",
                "Entrega la misión a Adler",
                "Párate al lado del hombre sentado en un banco y presiona la tecla NPC, acepta la misión y serás transportado a una nueva ubicación",
                "Mata al Mago Amarillo, completa la escena y luego recibirás una llave y serás transportado de vuelta al área principal",
                "Muévete a la siguiente área"
            ]
        },
        {
            "title": "Tierra de la Inocencia",
            "steps": [
                "Acepta una misión de Tina",
                "Obtén un libro de cualquier monstruo en el área",
                "Entrega la misión a Tina",
                "Acepta la misión de Tina",
                "Compra un Osito de Peluche Nuevo por 10,000 mesos",
                "Entrega la misión a Tina",
                "Acepta otra misión de Tina",
                "Haz doble clic en el libro en tu inventario para recibir una llave",
                "Muévete a la siguiente área"
            ]
        },
        {
            "title": "Tierra de los Guerreros",
            "steps": [
                "Sube el sol",
                "Elige 'Último Guerrero en Pie'",
                "Completa el minijuego luchando contra tres rondas de guerreros",
                "Entrega la misión sobre tu cabeza",
                "Entrega la misión a Beodog",
                "Muévete a la siguiente área"
            ]
        },
        {
            "title": "Tierra de las Riquezas",
            "steps": [
                "Entra en el portal a la izquierda y acepta una misión del Viejo Fabricante de Lápidas",
                "Ataca la roca a la derecha hasta que caiga una piedra, luego lleva la piedra al Viejo Fabricante de Lápidas. Observa la hora en que completas este paso, ya que solo puedes entregar esta misión después de 10 minutos",
                "Regresa al área principal, luego acepta ambas misiones de Joel. Una misión, 'Un Sabor Delicioso,' es una misión repetible que te da un importante artículo llamado Pieza de Oro Deliciosa. La otra misión te pide reunir [10 Cestas de Comida]. Una vez que las reúnas, entrega la misión y acepta otra misión que te pide eliminar 100 Ladrones del Tesoro Monstruosos. Completa ambas misiones, luego acepta otra misión de Joel",
                "Mueve el cofre de Joel afuera, luego entrega la misión a Joel",
                "Continúa completando la misión repetible de Joel 'Un Sabor Delicioso' hasta que tengas un total de 6 Piezas de Oro Deliciosas. Esta misión te pide reunir [20 Cestas de Comida] o eliminar 50 Ladrones del Tesoro Monstruosos, así que es recomendable reunir Cestas de Comida extra en el segundo mapa de esta área mientras matas Ladrones del Tesoro Monstruosos en este mapa también",
                "Acepta una misión de Ben y elige la última opción",
                "Acepta una misión de Mansa",
                "Haz clic en la bolsa de monedas en la esquina superior derecha para aceptar una misión",
                "Habla con Horemheb",
                "Acepta la misión sobre tu cabeza",
                "Entrega la misión a Louie el Promedio",
                "Muévete a la siguiente área"
            ]
        },
        {
            "title": "Tierra de la Contemplación",
            "steps": [
                "Muévete a la siguiente área"
            ]
        },
        {
            "title": "Tierra de la Inocencia",
            "steps": [
                "Haz clic en el cuenco de dulces frente a Tina para hacer que llueva (NO aceptes ni entregues ninguna misión en esta área)",
                "Muévete a la siguiente área"
            ]
        },
        {
            "title": "Tierra de los Guerreros",
            "steps": [
                "Haz clic en la estatua a la derecha para aceptar una nueva misión",
                "Entrega la misión a Edgar Tetch",
                "Haz clic en la estatua nuevamente para aceptar otra misión",
                "Consume tres Piezas de Oro Deliciosas, luego habla con Vulcanelli para obtener una llave",
                "Muévete a la siguiente área"
            ]
        },
        {
            "title": "Tierra de las Riquezas",
            "steps": [
                "Habla con Horemheb para obtener una llave",
                "Deberían haber pasado 10 minutos, así que entra en el portal a la izquierda y acepta la misión del Viejo Fabricante de Lápidas y recibe una nueva llave NOTA: NO hagas clic en el texto aquí. Se te presentarán tres opciones para cambiar el color de tu lápida cuando mueras. Este es un cambio permanente, así que ten cuidado con la opción que elijas. Si haces clic en el texto, elegirás la lápida dorada",
                "Sal del mapa y vuelve a entrar; el Viejo Fabricante de Lápidas se habrá movido a la derecha, así que acepta su nueva misión",
                "Muévete a la derecha y ataca las cinco lápidas para que caigan al área de abajo, luego muévete a la izquierda y habla con el Viejo Fabricante de Lápidas",
                "Entrega la misión al Viejo Fabricante de Lápidas para recibir una llave",
                "Sal al área principal, consume las últimas tres piezas de oro mientras estás fuera de las murallas, luego ataca la muralla hasta que ocurra una escena",
                "Entrega la misión a Mansa",
                "Entrega y acepta una nueva misión de Ben",
                "Mueve a Ben y su cofre afuera",
                "Muévete a la siguiente área cuatro veces, recorriendo todas las tierras hasta que vuelvas a llegar a la Tierra de las Riquezas",
                "Acepta una misión de Mansa",
                "Entrega la misión a la Pila de Tesoros de Mansa para obtener tu última llave!",
                "Muévete a la Tierra de los Comienzos, haz clic en cada candado y completa el contenido"
            ]
        }
    ]
}
